// - створити функцію яка виводить масив

function showrrey (arrey) {
    for (let i = 0; i <arrey.length; i++) {
        let argument = arrey[i];
        console.log(argument);
    }
}

// let arrey = [1,2,2,2,'hello',2,2]
// showrrey(arrey);

// - створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попвередню функцію.


function randomarr (arrey) {
    for (let i = 0; i <= 10 ; i++) {
        const arreyElement = arrey[i];
        arrey.push(Math.floor(Math.random() * 200) + 1);
    }
}


// let emptyarr = [];
// randomarr(emptyarr);
// showrrey(emptyarr);


// - створити функцію яка приймає три числа та виводить та повертає найменьше.

// function minOf3 (num1,num2,num3) {
//     if (num1===num2&&num1===num3) {
//         console.log("all num is identical ");
//         return;
//     }
//     if (num1===num2||num1===num3||num2===num3) {
//         console.log("some num is identical ");
//         return;
//     }
//     if (num1<num2&&num1<num3) {
//         console.log(num1);
//     } else if (num2<num1&&num2<num3) {
//         console.log(num2);
//     } else console.log(num3);
// }
//
// minOf3(1933,1233,193);

// - створити функцію яка приймає три числа та виводить та повертає найбільше.

// function maxOf3 (num1,num2,num3) {
//     if (num1===num2&&num1===num3) {
//         console.log("all num is identical ");
//         return;
//     }
//     if (num1===num2||num1===num3||num2===num3) {
//         console.log("some num is identical ");
//         return;
//     }
//     if (num1>num2&&num1>num3) {
//         console.log(num1);
//     } else if (num2>num1&&num2>num3) {
//         console.log(num2);
//     } else console.log(num3);
// }
//
// maxOf3(13,213,31);


// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

// function min_max () {
//     let min = arrey[0];
//     let max = arrey[0];
//
//     for (let i = 0; i < arrey.length; i++) {
//         if ( arrey[i] < min) {
//             min = arrey[i];
//         }
//
//         if (arrey[i] > max) {
//             max = arrey[i]
//         }
//     }
//     console.log('Мксимальне ' + max);
//     console.log('Мінімальне ' + min);
// }
//
// min_max(1,2,3,1,4,4,6,2,7,7,9,0,9,7,6,8,5,8,4,5,21,24);

// - створити функцію яка виводить масив

// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву

// function min_max (arrey) {
//     let min = arrey[0];
//     let max = arrey[0];
//
//     for (let i = 0; i < arrey.length; i++) {
//         if ( arrey[i] < min) {
//             min = arrey[i];
//         }
//
//         if (arrey[i] > max) {
//             max = arrey[i]
//         }
//     }
//     console.log('Мксимальне ' + max);
//     console.log('Мінімальне ' + min);
// }
//
// let arr = [];
// randomarr(arr);
// min_max(arr);
// showrrey(arr);

// - створити функцію яка приймає масив чисел та складає значення елементів масиву та повертає його.

// function addArrEl (arrey) {
//     let sum = 0;
//         for (let i = 0; i < arrey.length; i++) {
//         let arreyElement = arrey[i];
//         sum = sum + arreyElement;
//
//     }
//     console.log('Sum is ' + sum);
// }
//
// let arrrr =[];
// randomarr(arrrr);
// addArrEl(arrrr);
//


// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// - Створити функцію яка приймає масив будь яких объектів, та повертає значення кількості об'єктів в масиві

// - Створити функцію яка приймає масив будь яких объектів, та повертає загальн кількість полів в них

// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     Приклад
//     [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]

// - *** приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"

// - *** створити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.

// Двожина масиву від 2 до 100
// Приклад
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]
//
// Створити функцію яка :
// - Додає в боді блок з текстом "Hello owu"

// - Додає в боді елемент з текстом . Тип елементу та текст отримати через аргументи

// - приймає масив автомобілів (можна взяти з попередніх дз ),та  індентифікатор елемнту в який потрібно додати список цих автомобілів.

// Для кожного автомобіля створити свій блок, та додати його в елемент, індентифікатор якого ви отримали. Всі властивості авто в обному блоці

// - приймає масив автомобілів (можна взяти з попередніх дз ),та  індентифікатор елемнту в який потрібно додати список цих автомобілів.

// Для кожного автомобіля створити свій блок, та додати його в елемент, індентифікатор якого ви отримали.

// Для кожної властивості створити всередені блока автомоблія свій блок